tensorflow.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-04-28 Sun 22:29 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Tensorflow</title>
<meta name="generator" content="Org mode">
<meta name="author" content="shaka">
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Tensorflow</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0dc74da">Introducation</a></li>
<li><a href="#org8f4e673">Representation</a></li>
<li><a href="#orgc51dc6a">Operation</a></li>
<li><a href="#org920ca53">Tensor</a></li>
<li><a href="#org76ce34f">Variable</a></li>
<li><a href="#org40b67aa">Placeholder</a></li>
<li><a href="#orgf47a8f6">Session</a></li>
<li><a href="#orgeec1851">Execution</a></li>
<li><a href="#orgde2ba80">Graph</a></li>
<li><a href="#org762866a">Tensorboard</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0dc74da" class="outline-2">
<h2 id="org0dc74da">Introducation</h2>
<div class="outline-text-2" id="text-org0dc74da">
<p>
Tensorflow is a deep learning library, which provides two programming interfaces, C++ and Python. Moreover, The Python API integrates very well with <a href="http://www.numpy.org">numpy</a>. In many places, Tensorflow tensors can be interchanged with numpy <code>ndarrays</code>.
</p>
</div>
</div>
<div id="outline-container-org8f4e673" class="outline-2">
<h2 id="org8f4e673">Representation</h2>
<div class="outline-text-2" id="text-org8f4e673">
<p>
In tensorflow, machine learning algorithms are represented as <i>computational graphs</i>, i.e. <a href="#orgde2ba80"><code>graph</code></a>, in which a vertex/node and an edge represent an operation (<code>op</code>) and a data flowing, respectively.
</p>
</div>
</div>
<div id="outline-container-orgc51dc6a" class="outline-2">
<h2 id="orgc51dc6a">Operation</h2>
<div class="outline-text-2" id="text-orgc51dc6a">
<ul class="org-ul">
<li>An operation can have 0 or more inputs and produce zero or more outputs.</li>
<li>An operation may stand for a mathematical equation, a variable, a constant, a control flow directive, a file I/O operation, or even a network communication port.</li>
</ul>
</div>
</div>
<div id="outline-container-org920ca53" class="outline-2">
<h2 id="org920ca53">Tensor</h2>
<div class="outline-text-2" id="text-org920ca53">
<ul class="org-ul">
<li>A tensor is a multidimentional array or list, the generalization of scalars, 1-D vector, and 2-D matrices.</li>
<li>Tensors are the connecting edges, passed between nodes/ops in the flow diagram.</li>
<li>A tensor is a symbolic handle, which does not hold or store values in memory, but provides only an interface for retrieving the value referenced by the tensor.</li>
<li>Parameters
<dl class="org-dl">
<dt>Rank</dt><dd>The number of dimensions</dd>
<dt>Shape</dt><dd>The number of components in each dimension, e.g., the number of rows and columns.</dd>
<dt>Type</dt><dd>Data type assigned to the elements of the tensor</dd>
</dl></li>
</ul>
</div>
</div>
<div id="outline-container-org76ce34f" class="outline-2">
<h2 id="org76ce34f">Variable</h2>
<div class="outline-text-2" id="text-org76ce34f">
<ul class="org-ul">
<li>Variables can be described as persistent, mutable handlers to in-memory buffers storing tensors. They maintain the state of the graph across executions.</li>
<li>A variable can be identified as a revisable <a href="#org920ca53">tensor</a>.</li>
<li>To manipulate and update variables, the <code>assign</code> family of graph operations are provided.</li>
<li>A variable must be initialized before it has a value, and a variable itself does not store the initial tensor.
<ul class="org-ul">
<li>Call <code>initializer</code> operation for each variable.</li>
<li>Call <code>tensorflow.initialize_all_variables()</code>, which in turn executes the <code>initializer</code> operation for each variable in the graph.</li>
</ul></li>
<li>Variables can be saved in and restored from a <i>checkpoint</i> file by a <code>tensorflow.train.Saver</code> object, in which its <code>name</code> property is used by default. What deserves to be mentioned, a checkpoint allows for persistent storage and recovery of variables.</li>
</ul>
</div>
</div>
<div id="outline-container-org40b67aa" class="outline-2">
<h2 id="org40b67aa">Placeholder</h2>
<div class="outline-text-2" id="text-org40b67aa">
<ul class="org-ul">
<li>Placeholders are special variables, which must be replaced with concrete tensors on graph execution and supplied in the <code>feed_dict</code> argument to <code>Session.run()</code>.</li>
<li>For each placeholder, its shape and data type should be specified.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf47a8f6" class="outline-2">
<h2 id="orgf47a8f6">Session</h2>
<div class="outline-text-2" id="text-orgf47a8f6">
<ul class="org-ul">
<li>The execution of operations and evaluation of tensors may only be performed in a special environment referred to as <i>session</i>.</li>
<li>Its method <code>run</code> takes as input the nodes (including feed nodes) in the graph whose tensors should be computed and returned.
<ul class="org-ul">
<li>A feed can temporarily replace the output of an operation with a tensor.</li>
<li>A feed can be provided as an argument to <code>tensorflow.Session.run</code>.</li>
<li>The most common case is to designate an operation to be a feed by method <code>tensorflow.placeholder</code>.</li>
</ul></li>
<li>As a context manager, a <code>Session</code> object is indispensable to launch a graph.</li>
<li>Its constructor can be provided with a graph object, so that the <code>Session</code> object understands the target graph to manage.</li>
<li>The default constructor of the <code>Session</code> class will launch the default graph.</li>
<li>A session should be closed to release resources using <code>close</code> method. The procedure can also be automatically performed with a <code>with</code> block, i.e.,</li>
</ul>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b4fa70;">with</span> tensorflow.Session() <span style="color: #b4fa70;">as</span> s:
    <span style="color: #73d216;"># </span><span style="color: #73d216;">Some operations</span>
</pre>
</div>
<ul class="org-ul">
<li>In the case of interactive python shell, e.g., ipython, class <code>Session</code> can be replaced by class <code>InteractiveSession</code>.</li>
</ul>
</div>
</div>
<div id="outline-container-orgeec1851" class="outline-2">
<h2 id="orgeec1851">Execution</h2>
<div class="outline-text-2" id="text-orgeec1851">
<ul class="org-ul">
<li>A graph can be executed in the context of a <code>Session</code> in a couple of ways.
<ul class="org-ul">
<li>Call <code>Session.run()</code> and pass a list of tensors, which are desired to computed. Upon invocation of <code>run</code>, Tensorflow will start at the requested output nodes an work backwards, examining the graph dependencies and computing the full transitive closure of all nodes that must be executed.</li>
<li>Call <code>eval()</code> on tensors and <code>run()</code> on operations directly. In this case, it is possible to explicitly specify the order of node evaluations, a.k.a. <i>control dependencies</i>.</li>
</ul></li>
<li>Represent data as <code>tensors</code>.</li>
<li>Maintain state with <code>Variables</code>.</li>
<li>Use the operations of <code>feed</code> / <code>fetch</code> to get data into/out of an operation.</li>
</ul>
</div>
</div>
<div id="outline-container-orgde2ba80" class="outline-2">
<h2 id="orgde2ba80">Graph</h2>
<div class="outline-text-2" id="text-orgde2ba80">
<p>
Tensorflow programs are usually structured into a construction phase, that assembles a graph, and an execution phase that uses a session to execute ops in the graph.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #73d216;"># </span><span style="color: #73d216;">Create a new graph.</span>
<span style="color: #fcaf3e;">g</span> = tf.Graph()

<span style="color: #73d216;"># </span><span style="color: #73d216;">Register the graph g as the default one to add nodes.</span>
<span style="color: #b4fa70;">with</span> g.as_default():
    <span style="color: #73d216;"># </span><span style="color: #73d216;">Add operation nodes.</span>
</pre>
</div>
<p>
In the tensorflow Python library, there is a default graph to which ops constructors can add nodes. The default one is sufficient in most cases.
</p>
</div>
</div>
<div id="outline-container-org762866a" class="outline-2">
<h2 id="org762866a">Tensorboard</h2>
<div class="outline-text-2" id="text-org762866a">
<p>
As a built-in module inside tensorflow, <i>tensorboard</i> is a web interface for graph visualization and manipulation. It provides a couple of summary operations (nodes), <i>scalar summary</i> and <i>histogram summary</i>. The former shows the progression of a scalar tensor value, and the latter tracks distributions.
</p>

<p>
The concrete practice can be summarized into 3 steps as below.
</p>
<ol class="org-ol">
<li>Group nodes into <i>name scopes</i>.</li>
<li>Add scalar and histogram summaries to operations.</li>
<li>Instantiate a <code>SummaryWriter</code> object.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
